[
  {
    "slug": "momlife",
    "name": "#MomLife",
    "notionCategory": "MomLife",
    "cover": "momlife.jpeg",
    "featuredPost": "Becoming a mom has changed my life in more ways than I can count.  I often tell my husband that I don’t feel like my life really began until our daughter was born. Obviously, that’s not the case, and the 34 years of life that I lived before Bella (B.B. was a whole different era) were shaping me into the person I am today. The first time I held my baby in my arms, I felt like I had finally arrived at the chapter I was meant to be in. I felt the same way when Juliana was born. I had this overwhelming feeling of peace, and I knew that my family was complete."
  },
  {
    "slug": "health-wellness",
    "name": "Health & Wellness",
    "notionCategory": "Health & Wellness",
    "cover": "health_wellness.jpeg",
    "featuredPost": "Health and wellness is such a huge topic these days.  So much research is being done on living longer and fuller lives, which is really exciting! As a parent, it is so important to me to eat healthy, exercise, go for my annual exams, and do everything in my power to stay healthy and fit for my kids. In addition to being able to keep up with my young kids, I also want to be the grandma at the playground running around with my grandkids! I can say without question that when I prioritize my nutrition, exercise, and mental health, I am a better parent. You can ask my husband who has to pick up the slack after I go on a no-exercise/Christmas cookie binge :). Life feels so much more full when you take care of yourself and feel good. This section of the blog is all about ways to support this healthy lifestyle."
  },
  {
    "slug": "meal-planning-recipes",
    "name": "Recipes & Meal Planning",
    "notionCategory": "Recipes & Meal Planning",
    "cover": "recipes_meal_planning.jpeg",
    "featuredPost": "Meal planning seems to be a source of stress for most moms. How could it not be? Planning three meals a day (plus snacks, don’t forget the snacks!) for an entire family can be overwhelming and time-consuming.  Every family member has their own taste preferences and dietary needs and making sure everyone gets the nutrition they require while also enjoying their meals can be quite the task. I have learned some tips and tricks over the years to help simplify this process. I hope this section of the website will be helpful in doing the same for you!"
  },
  {
    "slug": "celebrate",
    "name": "Celebrate!",
    "notionCategory": "Celebrate!",
    "cover": "celebrate.jpeg",
    "featuredPost": "A main source of joy in my life stems from celebrations. I absolutely love to celebrate all of the special moments in life. From birthdays to holidays to special achievements that deserve a magical moment, I love to add a little sparkle to create a lasting memory. Life has so many ups and downs and can be full of so much hardship and stress. I think it is so important to add love and joy into the world whenever we can. Life is all about the journey, and I feel strongly that the journey should consist of lots of balloons and confetti."
  },
  {
    "slug": "travel",
    "name": "Travel",
    "notionCategory": "Travel",
    "cover": "travel.jpeg",
    "featuredPost": "When I think about what brings me joy, travel is one of the first things that comes to mind. I know that traveling is not always a possibility for every person at every time in their life, which is one of the many reasons that reading has always been so special to me. When I was young and not doing much actual traveling, I loved the feeling of being transported to a new place just by reading words on a page. My love of exploring new places started before I ever took a road trip or set foot on an airplane. I remember my grandma taking us to the library on the weekends, and being SO excited to pick out a new book and see where it would take me. We read to our girls every night, and I can’t wait until they can read on their own and take their first independent journeys through a book. Reading is absolutely where my love of travel started. Once I was older and able to start exploring the world for myself, I realized the pure joy that experiencing new places brings to the soul."
  }
]
